Revit 2025 API
LoadCaseCategory Enumeration
 Specifies load case category.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LoadCaseCategory
Public Enumeration LoadCaseCategory
public enum class LoadCaseCategory
type LoadCaseCategory
Members
Member name | Value | Description
Dead | 0 |  Dead
Live | 1 |  Live
Wind | 2 |  Wind
Snow | 3 |  Snow
RoofLive | 4 |  Roof Live
Accidental | 5 |  Accidental
Temperature | 6 |  Temperature
Seismic | 7 |  Seismic
See Also
Reference
Autodesk.Revit.DB.Structure Namespace